{
    "home" : {
        "title": "Hello, I'm yoonju !",
        "description" : "By combining creativity with modern web technologies I create warm and intuitive web experiences for users.",
        "subtitle" : "Web Developer (React & Next.js)",
        "button2" :"Graphic Design",
        "button3":"See my works"
    },

    "metadata": {
    "siteName": "My Portfolio",
    "siteDescription": "Frontend Developer Portfolio",
    "home": {
      "title": "Home",
      "description": "Welcome to my portfolio website"
    },
    "works": {
      "title": "Works",
      "description": "Here you can view my web development projects and graphic design works"
    },
    "about": {
      "title": "About me",
      "description": "Learn more about my resume and experience"
    }
  },

    "locale" : {
        "english": "English",
        "french": "French",
        "korean": "한국어"
    },

    "menu" :{
        "home" : "Home",
        "works": {
            "label": "Works",
            "web": "Web",
            "design": "Design"
        },
        "aboutme": "About me",
        "contact" : "Contact"
    },

    "theme": {
        "light": "Light",
        "dark": "Dark",
        "toggle": "Toggle theme"
    },

    "web" : {
        "title" : "Web Development",
        "description" : "I have built web applications using modern technologies such as React and Next.js. Rather than just focusing on functionality, I designed clear and user-friendly interfaces with responsive layouts that work smoothly across devices. I integrated multiple APIs and databases to deliver fast performance and a seamless user experience. By organizing code into reusable components, I made projects easier to maintain and expand. I also applied the latest web trends and accessibility standards so that anyone can use the applications comfortably. Through experience in planning, design, and development, I developed the ability to write clean code and collaborate effectively skills that can be applied directly in real-world projects."
    },

    "design" : {
        "title" : "Graphic Design",
        "description" : "With over three years of experience, I have built expertise in brand identity, illustration, and marketing content. Beyond creating visuals, I engage from the planning stage to translate clients’ visions and goals into effective design. By harmonizing color, typography, and imagery, I strengthen brand value and deliver creative, sustainable solutions that stand out."
    },
    "selection" : {
        "title" : "Select Discipline",
        "s0": "All", 
        "s1" : "Brand Communication",
        "s2" : "Product Design",
        "s3" : "Infographic Design",
        "s4" : "Print Design",
        "s5" : "Logo & Identity",
        "s6" : "Personal Projects"
    },

    "worksweb" : {
        "a15": {
            "title": "ArgentBank",
            "tags": ["React", "Node.js", "Redux", "MongoDB", "API", "Swagger"],
            "description": "I created a responsive dashboard and managed the application’s global state using React and Redux, integrating the back end through REST API calls. I defined the API endpoints with Swagger and used Node.js to handle the server."
            },
        "a14": {
            "title": "724 events",
            "tags": ["React", "Node.js", "SEO", "Unit testing", "Debug"],
            "description": "I reviewed and fixed bugs using Chrome DevTools and React Developer Tools. I resolved issues with JavaScript and React, implemented unit and functional tests, and used Yarn and Node.js for dependency management and test execution."
            },
        "a13": {
            "title": "Kasa",
            "tags": ["React", "Figma"],
            "description": "I developed a responsive web application using React. I set up navigation between pages with React Router and built the interface using reusable React components."
            },
        "a12": {
            "title": "Architecture",
            "tags": ["JavaScript", "CSS", "Node.js", "API", "Figma"],
            "description": "I created a dynamic webpage in JavaScript, including a login page and a modal for media uploads. I integrated a backend API and used Figma for layout and implementation. I also used Kanban for efficient task tracking and collaboration."
            }
    },

    "weblabels" : {
        "duration" : "Project duration",
        "techs" : "Tools & Technologies",
        "link" : "View on GitHub",
        "days" : "days",
        "learning" : "Achievements & Lessons Learned",
        "features" :"Core Features & Goals",
        "link2":"Visit Website"
    },
    "designlabels" : {
        "program" : "Tools & Software Used",
        "cy" : " Year of Creation",
        "company" : "Collaborating Company"
    },
    "worksgraphic" : {
        "b20": {
            "title": "Invitation",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Designed and produced web and print invitations for various Fusalp events, taking charge of incorporating the brand’s seasonal identity and visual elements into the overall design. Beyond simply creating event materials, I carefully considered color palettes, typography, and layout to effectively communicate the brand’s image and message, thereby reinforcing both brand consistency and the overall event experience.",
            "tags": ["Indesign"]
        },
        "b21": {
            "title": "Lookbook",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Creation of lookbooks, contributing to the visual representation of the brand’s seasonal collections and helping to promote its launch.",
            "tags": ["Indesign"]
        },
        "b19": {
            "title": "Magazine",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Creation of various fashion magazine pages that reflected the brand’s identity, designing visually appealing layouts to capture the readers’ attention.",
            "tags": ["Indesign"]
        },
        "b22": {
            "title": "Communication",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Creation of visuals for communication press, designing compelling graphics and images to effectively convey the brand’s message to the media and enhance its public presence.",
            "tags": ["Indesign"]
        },
        "b23": {
            "title": "Goodies",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Design of various promotional and gift products, including a card game design utilizing seasonal images and lookbooks, sticker designs for collaboration with the British ski team, chocolate box designs, water bottle designs, and more. All designs were crafted to align with the brand’s identity while maintaining a sophisticated and stylish aesthetic.",
            "tags": ["Illustrator", "Photoshop"]
        },
        "b24": {
            "title": "Product",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Vectorizing products for the new season using Illustrator and continuously updating design modifications throughout the product development process. Additionally, I contributed to the creation of a catalog that lists all the products once the product lineup was finalized.",
            "tags": ["Illustrator"]
        },
        "b25": {
            "title": "Pattern",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Create pattern designs for fabrics that reflect the identity of each season.",
            "tags": ["Illustrator"]
        },
        "b26": {
            "title": "Technical file",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Create technical files for the trims used in the products, providing accurate information necessary for the product development and production processes.",
            "tags": ["Illustrator"]
        },
        "b27": {
            "title": "Pictogram",
            "cy": "This project was created in 2022",
            "description": "Create pictograms for clothing labels, designing icons that clearly communicate washing and care instructions.",
            "tags": ["Illustrator"]
        },
        "b28": {
            "title": "Pictogram",
            "cy": "This project was created in 2021",
            "description": "Create pictograms for Workbook, designing icons that clearly communicate washing and care instructions.",
            "tags": ["Illustrator"]
        },
        "b29": {
            "title": "Frames",
            "cy": "This project was created in 2023",
            "description": "Carefully selected vintage images that aligned with the brand’s identity and carried out the design work of arranging photo frames on the wall.",
            "tags": ["Photoshop", "Indesign"]
        },
        "b30": {
            "title": "Advertising",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Creation of advertising visuals for the Paris metro, designing striking graphics to effectively promote the brand and capture the attention of commuters.",
            "tags": ["Indesign"]
        },
        "b31": {
            "title": "Storefront",
            "cy": "I worked on the same type of tasks from 2021 to 2023.",
            "description": "Development of window graphics for boutiques, incorporating design elements that align with the brand’s seasonal identity and visual language.",
            "tags": ["Indesign"]
        },
        "b32": {
            "title": "Montage",
            "cy": "I worked on the same type of tasks from 2020 to 2023.",
            "description": "I created my own unique visual montage by combining various images.",
            "tags": ["Photoshop"]
        },
        "b33": {
            "title": "Illustration",
            "cy": "I worked on the same type of tasks from 2020 to 2023.",
            "description": "I enjoy drawing illustrations, so I created works based on images that inspired me using Illustrator.",
            "tags": ["Illustrator"]
        },
        "b34": {
            "title": "Séoul",
            "cy": "This project was created in 2022",
            "description": "I created an animation of the night view of Seoul.",
            "tags": ["After Effect"]
        },
        "b35": {
            "title": "Electricité",
            "cy": "This project was created in 2023",
            "description": "I created a logo for the establishment of an electrical company and also worked on vehicle sticker designs.",
            "tags": ["Illustrator"]
        },
        "b36": {
            "title": "Fruit",
            "cy": "This project was created in 2022",
            "description": "Creation of a logo and business card for a food trading company.",
            "tags": ["Illustrator"]
        }
    }, 
    "aboutme" : {
        "title" : "Turning ideas into code, code into experience.",
        "job":"Frontend Web Developer (React/Next.js)",
        "description" : "First became interested in web design naturally while working in graphic design and this led me to develop a deeper passion for web development. After completing an Integrator Web training program in France I continued studying consistently and have since grown with a strong focus on frontend development. In particular, by working with Next.js. I have gained not only frontend expertise but also the ability to handle backend features when needed giving me full-stack capabilities. In addition, while my main focus remains frontend i have also built full-stack development experience using backend services such as Firebase. Moving forward, I am seeking opportunities as a frontend web developer to actively participate in real projects, grow further and contribute meaningfully.",
        "link1" : "Go to my GitHub",
        "cv" : "Download my CV"
  }, 
  "services": {
        "title": "My expertise",
        "web": "Web Development",
        "webdes": "I build web services using React and Next.js, focusing on SEO optimization, fast loading speeds, stable data handling and responsive UI to deliver intuitive and immersive user experiences.",
        "optimization": "Optimization",
        "optdes": "By applying code splitting, lazy loading, and image optimization, I improve performance while adhering to WAI-ARIA accessibility standards to achieve higher Lighthouse scores and provide an inclusive web environment.",
        "ui": "UI/UX Design",
        "uides": "I create reusable components and consistent design systems leveraging modern UI libraries such as shadcn/ui and NextUI to implement responsive interfaces. This ensures a seamless and consistent user experience across all devices.",
        "maintenance": "Maintenance",
        "maindes": "I refactor existing code, fix bugs and continuously integrate new features and SEO strategies to enhance stability, visibility and long-term performance of the web.",
        "deploying" : "Deployment & Hosting",
        "deployingdes": "I deploy projects efficiently using Vercel leveraging a serverless environment to deliver stable and fast web services."
    },
    "skills": {
        "title": "Tech Stack & Design Tools",
        "description": "Explore the technologies and tools I use across web development and design.",
        "all": "All",
        "webtool": "Web Tools",
        "designtool": "Design Tools"
    },
    "experience": {
        "title1": "Freelance Graphic Designer",
        "des1": "Created visual content for marketing: social media, lookbooks, product illustrations, photography and advertising.",
        "office1": "Annecy-le-Vieux (74), France",

        "title2": "Graphic Design Intern",
        "des2": "Planned and produced content aligned with marketing strategies.",
        "office2": "Annecy-le-Vieux (74), France",

        "title3": "Trilingual Customer Service (Korean · English · French)",
        "des3": "Handled tax refund services, data management and daily reporting.",
        "office3": "Paris (7e), France",

        "title4": "Apparel Sourcing & Supply (Vendor)",
        "des4": "Supported raw material orders, quality control, sample management and delivery schedules.",
        "office4": "Seoul, South Korea"
    },
    "education": {
        "title1": "Web Integration",
        "degree1": "French RNCP 5, Associate Degree",
        "location1": "Paris, France",
        "name1": "OpenClassRooms",

        "title2": "Graphic Design",
        "degree2": "Bac +2, Associate Degree",
        "location2": "Montrouge, France",
        "name2": "Lignes et Formation",

        "title3": "French Language Studies",
        "degree3": "Level B2, CECRL",
        "location3": "Annecy, France",
        "name3": "Ifalpes",

        "title4": "Fashion & Textiles",
        "degree4": "Bachelor of Science",
        "location4": "Seoul, South Korea",
        "name4": "Sangmyung University"
    },
     "contact" :{
        "title" : "Contact Me",
        "des1": "Interested in starting a web project together? If you have any ideas or questions don’t hesitate to contact me by email",
        "des2" : "Let’s build your great project together.",
        "bt1": "Contact me today!!",
        "name": "Name",
        "np": "Last name, first name",
        "email": "Email",
        "message":"Message",
        "mp": "Your message...",
        "bt2": "Send",
        "loading" : "Sending...",
        "address": "Address",
        "toast": "Email sent successfully.",
        "toastError": "Failed to send email. Please try again later."
    },
    "footer": {
        "des" : "2025 all rights reserved by TERRENOIRE Yoonju",
        "linkedin":"See my LinkedIn",
        "github" : "See my GitHub",
        "email" : "Send E-mail"
    }
}


