{ 
  "home" : {
    "title": "Bonjour, je suis Yoonju!",
    "description" : "En alliant créativité et technologies web modernes je conçois des expériences web chaleureuses et intuitives. ",
    "button1" : "Development Web",
    "button2" :"Design Graphique",
    "button3":"Voir mon portfolio"
    }, 

  "locale": {
    "english": "Anglais",
    "french": "Français",
    "korean": "한국어"
    },

  "menu" :{
    "home" : "Accueil",
    "works" : {
      "label": "Réalisations",
      "web": "Web",
      "design": "Design"
    },
    "aboutme": "À propos",
    "contact" : "Contact"
  },
  
  "theme": {
    "light": "Clair",
    "dark": "Sombre",
    "toggle": "Changer le thème"
  },

  "web" : {
    "title" : "Development Web",
    "description" : "J’ai développé des applications web en utilisant des technologies modernes telles que React et Next.js. Au-delà de la simple fonctionnalité, j’ai conçu des interfaces claires et faciles à utiliser, avec des mises en page responsives adaptées à tous les appareils. J’ai intégré plusieurs API et bases de données afin d’offrir de bonnes performances et une expérience fluide pour l’utilisateur. En structurant le code sous forme de composants réutilisables, j’ai facilité la maintenance et l’évolution des projets. J’ai également appliqué les dernières tendances du web et les normes d’accessibilité pour garantir une utilisation confortable par tous. Grâce à une expérience couvrant la planification, le design et le développement, j’ai acquis la capacité d’écrire un code propre et de collaborer efficacement des compétences directement applicables en entreprise."
  },
  "design" : {
    "title" : "Design Graphic",
    "description" : "Fort de plus de trois ans d’expérience, j’ai développé une expertise en identité de marque, illustration et création de contenus marketing. Au-delà de la réalisation visuelle, j’interviens dès la phase de conception pour traduire la vision et les objectifs des clients en design efficace. En alliant couleurs, typographie et images, je renforce la valeur de la marque et propose des solutions créatives et durables."
  }, 

  "selection" : {
      "title" : "Sélection de catégorie",
      "s1" : "Communication",
      "s2" : "Design produits",
      "s3" : "Design infographie",
      "s4" : "Design imprimé",
      "s5" : "Logo & Identité visuelle",
      "s6" : "Projets personnels"
    }, 

  "worksweb": {
    "a15": {
      "title": "ArgentBank",
      "tags": ["React", "Node.js", "Redux", "MongoDB", "API", "Swagger"],
      "description": "J’ai conçu un tableau de bord responsive et géré l’état global de l’application avec React et Redux, tout en intégrant le back-end via des appels REST. J’ai défini les endpoints avec Swagger et utilisé Node.js pour la partie serveur."
    },
    "a14": {
      "title": "724 events",
      "tags": ["React", "Node.js", "SEO", "Tests unitaires", "Débogage"],
      "description": "J’ai analysé et corrigé des anomalies avec Chrome DevTools et React Developer Tools. J’ai résolu des problèmes JavaScript/React, mis en place des tests unitaires et fonctionnels, et utilisé Yarn et Node.js pour la gestion des dépendances et l’exécution des tests."
    },
    "a13": {
       "title": "Kasa",
      "tags": ["React", "Figma"],
      "description": "J’ai développé une application web responsive avec React. J’ai configuré la navigation entre les pages avec React Router et construit l’interface à l’aide de composants réutilisables."
    },
    "a12": {
      "title": "Architecture",
      "tags": ["JavaScript", "CSS", "Node.js", "API", "Figma"],
      "description": "J’ai créé une page web dynamique en JavaScript, incluant une page de connexion et une modale d’upload. J’ai intégré une API back-end et utilisé Figma pour la conception et la mise en page. J’ai également adopté une gestion Kanban pour un suivi efficace des tâches."
    }
  },

  "weblabels" : {
      "duration" : "Durée du project",
      "techs" : "Outils et technologies",
      "link" : "Voir sur GitHub",
      "days" : "jours"
  },
  "designlabels" : {
    "program" : "Logiciel utilisés",
    "cy" : "Année de création",
    "company" : "Entreprise collaboratrice"
  },
  "worksgraphic": {
    "b20": {
      "title": "Invitation",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Conception et réalisation d’invitations web et imprimées pour divers événements de Fusalp, en intégrant l’identité saisonnière et les éléments visuels de la marque dans le design global. Plus qu’un simple support de communication, chaque invitation a été pensée dans le choix des couleurs, de la typographie et de la mise en page afin de transmettre efficacement l’image et le message de la marque, contribuant ainsi à renforcer la cohérence visuelle et l’expérience globale de l’événement.",
      "tags": ["Indesign"]
    },
    "b21": {
      "title": "Lookbook",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Création de lookbooks, contribuant à la représentation visuelle des collections saisonnières de la marque et à la promotion de leurs lancements.",
      "tags": ["Indesign"]
    },
    "b19": {
      "title": "Magazine",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Création de pages de magazines de mode reflétant l’identité de la marque, avec des mises en page visuelles attractives pour capter l’attention des lecteurs.",
      "tags": ["Indesign"]
    },
    "b22": {
      "title": "Communication",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Création de visuels de presse, conception de graphiques et d’images percutants pour transmettre efficacement le message de la marque aux médias et renforcer sa présence publique.",
      "tags": ["Indesign"]
    },
    "b23": {
      "title": "Goodies",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Conception de divers produits promotionnels et cadeaux, dont un jeu de cartes utilisant des images saisonnières et lookbooks, des autocollants pour une collaboration avec l’équipe britannique de ski, des boîtes de chocolats, des bouteilles d’eau, etc. Tous les designs ont été réalisés dans le respect de l’identité de la marque, avec une esthétique sophistiquée et élégante.",
      "tags": ["Illustrator", "Photoshop"]
    },
    "b24": {
      "title": "Produit",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Vectorisation de produits pour la nouvelle saison avec Illustrator et mise à jour continue des modifications de design tout au long du processus de développement. Contribution également à la création d’un catalogue listant tous les produits une fois la gamme finalisée.",
      "tags": ["Illustrator"]
    },
    "b25": {
      "title": "Motif",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Création de motifs pour tissus reflétant l’identité de chaque saison.",
      "tags": ["Illustrator"]
    },
    "b26": {
      "title": "Fiche technique",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Création de fiches techniques pour les accessoires utilisés dans les produits, fournissant des informations précises nécessaires au développement et à la production.",
      "tags": ["Illustrator"]
    },
    "b27": {
      "title": "Pictogramme",
      "cy": "Ce projet a été réalisé en 2022.",
      "description": "Création de pictogrammes pour les étiquettes de vêtements, avec des icônes claires pour communiquer les instructions de lavage et d’entretien.",
      "tags": ["Illustrator"]
    },
    "b28": {
      "title": "Pictogramme",
      "cy": "Ce projet a été réalisé en 2021.",
      "description": "Création de pictogrammes pour un Workbook, avec des icônes claires pour communiquer les instructions de lavage et d’entretien.",
      "tags": ["Illustrator"]
    },
    "b29": {
      "title": "Cadres",
      "cy": "Ce projet a été réalisé en 2023.",
      "description": "Sélection d’images vintage en accord avec l’identité de la marque et création d’une mise en page murale de cadres photos.",
      "tags": ["Photoshop", "Indesign"]
    },
    "b30": {
      "title": "Publicité",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Création de visuels publicitaires pour le métro parisien, avec des graphismes percutants afin de promouvoir efficacement la marque et capter l’attention des voyageurs.",
      "tags": ["Indesign"]
    },
    "b31": {
      "title": "Vitrine",
      "cy": "J’ai travaillé sur ce type de tâches de 2021 à 2023.",
      "description": "Conception de graphismes pour les vitrines de boutiques, intégrant des éléments en accord avec l’identité visuelle et saisonnière de la marque.",
      "tags": ["Indesign"]
    },
    "b32": {
      "title": "Montage",
      "cy": "J’ai travaillé sur ce type de tâches de 2020 à 2023.",
      "description": "Création d’un montage visuel unique en combinant diverses images.",
      "tags": ["Photoshop"]
    },
    "b33": {
      "title": "Illustration",
      "cy": "J’ai travaillé sur ce type de tâches de 2020 à 2023.",
      "description": "Passionné par l’illustration, j’ai créé des œuvres inspirées d’images en utilisant Illustrator.",
      "tags": ["Illustrator"]
    },
    "b34": {
      "title": "Séoul",
      "cy": "Ce projet a été réalisé en 2022.",
      "description": "Création d’une animation de la vue nocturne de Séoul.",
      "tags": ["After Effect"]
    },
    "b35": {
      "title": "Électricité",
      "cy": "Ce projet a été réalisé en 2023.",
      "description": "Création d’un logo pour une entreprise d’électricité ainsi que des autocollants pour véhicules.",
      "tags": ["Illustrator"]
    },
    "b36": {
      "title": "Fruit",
      "cy": "Ce projet a été réalisé en 2022.",
      "description": "Création d’un logo et d’une carte de visite pour une société de commerce alimentaire.",
      "tags": ["Illustrator"]
    }
  },
  "aboutme" : {
    "title" : "Grandir en transformant les idées en réalité.",
    "job":"Développeuse Web Frontend (React/Next.js)",
    "description" : "C’est en travaillant dans le design graphique que je me suis naturellement intéressé au design web puis plus largement au développement web. Après avoir suivi une formation d’Intégrateur Web en France j’ai continué à me former de manière régulière et j’ai évolué avec un fort accent sur le développement frontend. Grâce à l’utilisation de Next.js j’ai acquis non seulement une expertise en frontend mais aussi la capacité de gérer certaines fonctionnalités backend lorsque nécessaire développant ainsi des compétences full-stack. De plus même si mon axe principal reste le frontend j’ai également acquis de l’expérience en développement full-stack en utilisant des services backend comme Firebase. Aujourd’hui je cherche à rejoindre des projets en tant que développeur frontend afin d’y participer activement, progresser davantage et y apporter ma contribution.",
    "link1" : "Accèder à mon GitHub",
    "cv" : "Télécharger mon CV"
  },
  "services": {
    "title":"Mes Services",
    "web": "Développement Web",
    "webdes": "Je développe des services web avec React et Next.js en mettant l’accent sur l’optimisation SEO la rapidité de chargement une gestion fiable des données et des interfaces responsives pour offrir une expérience utilisateur intuitive et immersive.",
    "optimization": "Optimisation",
    "optdes": "Grâce au code splitting, au lazy loading et à l’optimisation des images j’améliore les performances tout en respectant les normes d’accessibilité WAI-ARIA afin d’obtenir de meilleurs scores Lighthouse et de garantir un environnement web inclusif.",
    "ui": "Conception UI/UX",
    "uides": "Je conçois des composants réutilisables et des systèmes de design cohérents en utilisant des bibliothèques modernes comme shadcn/ui et NextUI pour créer des interfaces responsives. Cela assure une expérience utilisateur fluide et homogène sur tous les appareils.",
    "maintenance": "Maintenance",
    "maindes": "Je refactore le code existant, corrige les bugs et intègre en continu de nouvelles fonctionnalités ainsi que des stratégies SEO afin d’améliorer la stabilité, la visibilité et les performances à long terme du site.",
    "deploying" : "Déploiement et Hébergement",
    "deployingdes": "Je déploie efficacement les projets avec Vercel en tirant parti d’un environnement serverless pour offrir des services web rapides et stables."
  },
  "skills": {
    "title": "Stack Technique & Outils de Design",
    "description": "Découvrez les technologies et outils que j’utilise pour le développement web et le design.",
    "all": "Tout",
    "webtool": "Outils de Web",
    "designtool": "Outils de Design"
  },
  "experience": {
    "title1": "Graphiste Indépendante",
    "des1": "Création de contenus visuels pour le marketing : réseaux sociaux, lookbooks, illustrations produits, photographie et publicités.",
    "office1": "Annecy-le-Vieux (74), France",

    "title2": "Graphiste (Stagiaire)",
    "des2": "Conception et production de contenus en accord avec la stratégie marketing.",
    "office2": "Annecy-le-Vieux (74), France",

    "title3": "Service Client Trilingue (Coréen · Anglais · Français)",
    "des3": "Accueil clients pour remboursements de taxe, gestion des données et rapports quotidiens.",
    "office3": "Paris (7e), France",

    "title4": "Sourcing & Fourniture d’Habillement (Vendor)",
    "des4": "Support aux commandes, contrôle qualité, gestion des échantillons et suivi des délais.",
    "office4": "Séoul, Corée du Sud"
  },
  "education": {
    "title1": "Intégration Web",
    "degree1": "RNCP, niveau 5",
    "location1": "Paris, France",
    "name1": "OpenClassRooms",

    "title2": "Design Graphique",
    "degree2": "Bac+2, Formation certifiée Qualiopi",
    "location2": "Montrouge, France",
    "name2": "Lignes et Formation",

    "title3": "Études de Langue Française",
    "degree3": "Niveau B2, CECRL",
    "location3": "Annecy, France",
    "name3": "Ifalpes",

    "title4": "Mode & Textiles",
    "degree4": "Licence en Sciences",
    "location4": "Séoul, Corée du Sud",
    "name4": "Université Sangmyung"
  },
  "contact": {
    "title": "Me Contacter",
    "des1": "Envie de lancer un projet web ensemble ? Si vous avez des idées ou des questions n’hésitez pas à me contacter par email.",
    "des2": "Réalisons ensemble votre beau projet.",
    "bt1": "Me Contacter",
    "name": "Nom",
    "np": "Nom, prénom",
    "email": "Email",
    "message": "Message",
    "mp": "Votre message...",
    "bt2": "Envoyer",
    "loading" : "Envoi en cours…",
    "address": "Adresse"
  },
  "footer": {
    "des" : "© 2025 Tous droits réservés par TERRENOIRE Yoonju",
    "linkedin":"Voir mon LinkedIn",
    "github" : "Voir mon GitHub",
    "email" : "Envoyer un E-mail"
    }
}